system/fwhControl
FwhSurfacesSphere-Patch
{
        type            FfowcsWilliamsHawkings;
        formulationType Farassat1AFormulation;
        #include        "commonSettings";
        patches ();
        interpolationScheme cellPoint;

        surfaces
        (
                propellerTip
                {
                    type            patch;
                    patches         (propellerTip);
                    interpolate     false;
                }
        );

        cleanFreq       100;
        nonUniformSurfaceMotion true;
        Ufwh    (.0 .0 .0);
        U0      (.0 .0 .0);
        fixedResponseDelay false;
        responseDelay   0.01;
}

FwhSurfacesSphere_PatchFixedDelay
{
        type            FfowcsWilliamsHawkings;
        formulationType Farassat1AFormulation;
        #include        "commonSettings";
        patches ();
        interpolationScheme cellPoint;

        surfaces
        (
                propellerTip
                {
                    type            patch;
                    patches         (propellerTip);
                    interpolate     false;
                }
        );

        cleanFreq       100;
        nonUniformSurfaceMotion true;
        Ufwh    (.0 .0 .0);
        U0      (.0 .0 .0);
        fixedResponseDelay true;
        responseDelay   0.01;
}
